import time
from os import system

def index():

    print('''
      ██████╗    █████╗         ███████╗ ██╗  ██╗ ██████╗ ████████╗  ██████╗     ██████╗   ██╗
    ██╝     ██╗ ██╔══██╗        ██╔════╝ ╚██╗██╔╝ ██╔══██╗╚══██╔══╝██╝     ██╗ ██╝     ██║ ██║
    ██      ██║ ███████║ █████╗ █████╗    ╚███╔╝  ██████╔╝   ██║   ██      ██║ ██      ██║ ██║
    ██      ██║ ██╔══██║ ╚════╝ ██╔══╝    ██╔██╗  ██╔═══╝    ██║   ██      ██║ ██      ██║ ██║
    ╚═██████╔═╝ ██║  ██║        ███████╗ ██╔╝ ██╗ ██║        ██║   ╚═██████╔═╝ ╚═██████╔═╝ ███████╗
      ╚═════╝   ╚═╝  ╚═╝        ╚══════╝ ╚═╝  ╚═╝ ╚═╝        ╚═╝     ╚═════╝     ╚═════╝   ╚══════╝
    使用时请先查看使用说明
                               热门OA参数：
                                        zyscan:致远OA漏洞POC
                                        tdscan:通达OA漏洞POC
                                        yyscan:用友OA漏洞POC
                                        whscan:万户OA漏洞POC
                                        llscan:蓝凌OA漏洞POC
                                        fwscan:泛微OA漏洞POC
    _________________________________________________________________________________________________
    
    clear:清屏                                                                        作者:西瓜麻辣烫
    ''')  


        
def loading():
    for i in range(0,105):
        time.sleep(0.005)
        print('-',end = "", file=sys.stdout, flush=True)